1、前后端分离是一种软件架构模式，将应用程序的“用户界面（前端）”与“业务逻辑及数据处理（后端）”完全解耦。

前端（Frontend）： 负责展现逻辑，通常是单页面应用（SPA）。它像一个独立的客户端，通过浏览器运行，负责页面路由、交互动画和数据渲染。

后端（Backend）： 负责核心业务逻辑、数据库交互和安全性。它不再关心界面长什么样，只提供 无状态的 API 接口（通常是 JSON 格式）。


2、在开发大模型应用（如 Chatbot）时，由于 LLM 本身是无状态（Stateless）的，它不会记得你上一句话说了什么。

[
  {"role": "user", "content": "你好，请问今天天气怎么样？"},
  {"role": "assistant", "content": "今天天气晴朗，温度约为 25°C。"},
  {"role": "user", "content": "那我适合去爬山吗？"}
]

- 只保留最近的 K 轮对话。当新对话进入时，移除最旧的一条。这能保证模型始终记得最近的语境，同时控制成本。
- 当对话过长时，调用大模型对之前的历史做一个“简短摘要”。
- 从历史对话中检索到相关的信息 + 最近的K条 作为历史。
